Tekla.Structures.Dialog.UIControls.ComponentCatalogCollectionDataSource
Component catalog dialog data source.

Tekla.Structures.Dialog.UIControls.ComponentCatalogCollectionDataSource.componentCatalogCollectionItems
List of component catalog collection items.

Tekla.Structures.Dialog.UIControls.ComponentCatalogCollectionDataSource.#cctor
Initializes static members of the ComponentCatalogCollectionDataSource class.

Tekla.Structures.Dialog.UIControls.ComponentCatalogCollectionDataSource.AddItem(Tekla.Structures.Catalogs.ComponentItem)
Add new Component catalog dialog data item to datasource.
item: The component item to be added to catalog data dialog datasource.
Returns: True if item added successfully.

Tekla.Structures.Dialog.UIControls.ComponentCatalogCollectionDataSource.AddCollection(System.Int32,System.String,System.String)
Add new Component catalog dialog data collection item to datasource.
number: The number of the component item.
name: The name of the component item.
newCollection: The collection name to be added to the component dialog item.

Tekla.Structures.Dialog.UIControls.ComponentCatalogCollectionDataSource.AddCollection(System.String,System.String)
Add new Component catalog dialog data collection item based on UI name to datasource.
uiName: The UI name of the component item.
newCollection: The collection name to be added.

Tekla.Structures.Dialog.UIControls.ComponentCatalogCollectionDataSource.ClearItems
Clear all items in the datasource.

Tekla.Structures.Dialog.UIControls.ComponentCatalogCollectionDataSource.GetComponentItems(System.String)
Get Component item list based on collection string.
collectionName: The collection name used to search component items from the datasource.
Returns: List of component items matching criteria.

Tekla.Structures.Dialog.UIControls.ComponentCatalogCollectionDataSource.GetComponentItemsContainingText(System.String)
Get Component item list based on search text.
searchText: The collection name used to search component items from the datasource.
Returns: List of component items matching criteria.

Tekla.Structures.Dialog.UIControls.ComponentCatalogCollectionDataSource.GetAllPluginItems
Get all plug-in items from the datasource.
Returns: List of component items matching criteria.

Tekla.Structures.Dialog.UIControls.ComponentCatalogCollectionDataSource.GetAllCustomComponentItems
Get all custom component items from the datasource.
Returns: List of component items matching criteria.

Tekla.Structures.Dialog.UIControls.ComponentCatalogCollectionDataSource.GetAllComponentItems
Get all component items from the datasource.
Returns: List of component items matching criteria.